7767517
123 139
Input            input                    0 1 input
Convolution      Conv_0                   1 1 input 490 0=8 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=216
ReLU             LeakyRelu_1              1 1 490 303 0=1.000000e-01
ConvolutionDepthWise Conv_2                   1 1 303 493 0=8 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=72 7=8
ReLU             LeakyRelu_3              1 1 493 306 0=1.000000e-01
Convolution      Conv_4                   1 1 306 496 0=16 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=128
ReLU             LeakyRelu_5              1 1 496 309 0=1.000000e-01
ConvolutionDepthWise Conv_6                   1 1 309 499 0=16 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=144 7=16
ReLU             LeakyRelu_7              1 1 499 312 0=1.000000e-01
Convolution      Conv_8                   1 1 312 502 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
ReLU             LeakyRelu_9              1 1 502 315 0=1.000000e-01
ConvolutionDepthWise Conv_10                  1 1 315 505 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             LeakyRelu_11             1 1 505 318 0=1.000000e-01
Convolution      Conv_12                  1 1 318 508 0=32 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1024
ReLU             LeakyRelu_13             1 1 508 321 0=1.000000e-01
ConvolutionDepthWise Conv_14                  1 1 321 511 0=32 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=288 7=32
ReLU             LeakyRelu_15             1 1 511 324 0=1.000000e-01
Convolution      Conv_16                  1 1 324 514 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=2048
ReLU             LeakyRelu_17             1 1 514 327 0=1.000000e-01
ConvolutionDepthWise Conv_18                  1 1 327 517 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             LeakyRelu_19             1 1 517 330 0=1.000000e-01
Convolution      Conv_20                  1 1 330 520 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             LeakyRelu_21             1 1 520 333 0=1.000000e-01
Split            splitncnn_0              1 2 333 333_splitncnn_0 333_splitncnn_1
ConvolutionDepthWise Conv_22                  1 1 333_splitncnn_1 523 0=64 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=576 7=64
ReLU             LeakyRelu_23             1 1 523 336 0=1.000000e-01
Convolution      Conv_24                  1 1 336 526 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             LeakyRelu_25             1 1 526 339 0=1.000000e-01
ConvolutionDepthWise Conv_26                  1 1 339 529 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             LeakyRelu_27             1 1 529 342 0=1.000000e-01
Convolution      Conv_28                  1 1 342 532 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             LeakyRelu_29             1 1 532 345 0=1.000000e-01
ConvolutionDepthWise Conv_30                  1 1 345 535 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             LeakyRelu_31             1 1 535 348 0=1.000000e-01
Convolution      Conv_32                  1 1 348 538 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             LeakyRelu_33             1 1 538 351 0=1.000000e-01
ConvolutionDepthWise Conv_34                  1 1 351 541 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             LeakyRelu_35             1 1 541 354 0=1.000000e-01
Convolution      Conv_36                  1 1 354 544 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             LeakyRelu_37             1 1 544 357 0=1.000000e-01
ConvolutionDepthWise Conv_38                  1 1 357 547 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             LeakyRelu_39             1 1 547 360 0=1.000000e-01
Convolution      Conv_40                  1 1 360 550 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             LeakyRelu_41             1 1 550 363 0=1.000000e-01
ConvolutionDepthWise Conv_42                  1 1 363 553 0=128 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             LeakyRelu_43             1 1 553 366 0=1.000000e-01
Convolution      Conv_44                  1 1 366 556 0=128 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             LeakyRelu_45             1 1 556 369 0=1.000000e-01
Split            splitncnn_1              1 2 369 369_splitncnn_0 369_splitncnn_1
ConvolutionDepthWise Conv_46                  1 1 369_splitncnn_1 559 0=128 1=3 11=3 2=1 12=1 3=2 13=2 4=1 14=1 15=1 16=1 5=1 6=1152 7=128
ReLU             LeakyRelu_47             1 1 559 372 0=1.000000e-01
Convolution      Conv_48                  1 1 372 562 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=32768
ReLU             LeakyRelu_49             1 1 562 375 0=1.000000e-01
ConvolutionDepthWise Conv_50                  1 1 375 565 0=256 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304 7=256
ReLU             LeakyRelu_51             1 1 565 378 0=1.000000e-01
Convolution      Conv_52                  1 1 378 568 0=256 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=65536
ReLU             LeakyRelu_53             1 1 568 381 0=1.000000e-01
Convolution      Conv_54                  1 1 333_splitncnn_0 571 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=4096
ReLU             LeakyRelu_55             1 1 571 384 0=1.000000e-01
Convolution      Conv_56                  1 1 369_splitncnn_0 574 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=8192
ReLU             LeakyRelu_57             1 1 574 387 0=1.000000e-01
Convolution      Conv_58                  1 1 381 577 0=64 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=16384
ReLU             LeakyRelu_59             1 1 577 390 0=1.000000e-01
Split            splitncnn_2              1 3 390 390_splitncnn_0 390_splitncnn_1 390_splitncnn_2
Interp           Resize_68                1 1 390_splitncnn_2 405 0=1 1=1.000000e+00 2=1.000000e+00 3=20 4=20 6=0
BinaryOp         Add_69                   2 1 387 405 406 0=0
Convolution      Conv_70                  1 1 406 580 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             LeakyRelu_71             1 1 580 409 0=1.000000e-01
Split            splitncnn_3              1 3 409 409_splitncnn_0 409_splitncnn_1 409_splitncnn_2
Interp           Resize_80                1 1 409_splitncnn_2 424 0=1 1=1.000000e+00 2=1.000000e+00 3=40 4=40 6=0
BinaryOp         Add_81                   2 1 384 424 425 0=0
Convolution      Conv_82                  1 1 425 583 0=64 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=36864
ReLU             LeakyRelu_83             1 1 583 428 0=1.000000e-01
Split            splitncnn_4              1 2 428 428_splitncnn_0 428_splitncnn_1
Convolution      Conv_84                  1 1 428_splitncnn_1 586 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=18432
Convolution      Conv_85                  1 1 428_splitncnn_0 589 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
ReLU             LeakyRelu_86             1 1 589 433 0=1.000000e-01
Split            splitncnn_5              1 2 433 433_splitncnn_0 433_splitncnn_1
Convolution      Conv_87                  1 1 433_splitncnn_1 592 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Convolution      Conv_88                  1 1 433_splitncnn_0 595 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_89             1 1 595 438 0=1.000000e-01
Convolution      Conv_90                  1 1 438 598 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Concat           Concat_91                3 1 586 592 598 441 0=0
ReLU             Relu_92                  1 1 441 442
Split            splitncnn_6              1 3 442 442_splitncnn_0 442_splitncnn_1 442_splitncnn_2
Convolution      Conv_93                  1 1 409_splitncnn_1 601 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=18432
Convolution      Conv_94                  1 1 409_splitncnn_0 604 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
ReLU             LeakyRelu_95             1 1 604 447 0=1.000000e-01
Split            splitncnn_7              1 2 447 447_splitncnn_0 447_splitncnn_1
Convolution      Conv_96                  1 1 447_splitncnn_1 607 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Convolution      Conv_97                  1 1 447_splitncnn_0 610 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_98             1 1 610 452 0=1.000000e-01
Convolution      Conv_99                  1 1 452 613 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Concat           Concat_100               3 1 601 607 613 455 0=0
ReLU             Relu_101                 1 1 455 456
Split            splitncnn_8              1 3 456 456_splitncnn_0 456_splitncnn_1 456_splitncnn_2
Convolution      Conv_102                 1 1 390_splitncnn_1 616 0=32 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=18432
Convolution      Conv_103                 1 1 390_splitncnn_0 619 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=9216
ReLU             LeakyRelu_104            1 1 619 461 0=1.000000e-01
Split            splitncnn_9              1 2 461 461_splitncnn_0 461_splitncnn_1
Convolution      Conv_105                 1 1 461_splitncnn_1 622 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Convolution      Conv_106                 1 1 461_splitncnn_0 625 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
ReLU             LeakyRelu_107            1 1 625 466 0=1.000000e-01
Convolution      Conv_108                 1 1 466 628 0=16 1=3 11=3 2=1 12=1 3=1 13=1 4=1 14=1 15=1 16=1 5=1 6=2304
Concat           Concat_109               3 1 616 622 628 469 0=0
ReLU             Relu_110                 1 1 469 470
Split            splitncnn_10             1 3 470 470_splitncnn_0 470_splitncnn_1 470_splitncnn_2
Convolution      Conv_111                 1 1 442_splitncnn_2 471 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      Conv_112                 1 1 442_splitncnn_1 472 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Convolution      Conv_113                 1 1 442_splitncnn_0 473 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1280
Convolution      Conv_114                 1 1 456_splitncnn_2 474 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      Conv_115                 1 1 456_splitncnn_1 475 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Convolution      Conv_116                 1 1 456_splitncnn_0 476 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1280
Convolution      Conv_117                 1 1 470_splitncnn_2 477 0=8 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=512
Convolution      Conv_118                 1 1 470_splitncnn_1 478 0=4 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=256
Convolution      Conv_119                 1 1 470_splitncnn_0 479 0=20 1=1 11=1 2=1 12=1 3=1 13=1 4=0 14=0 15=0 16=0 5=1 6=1280
Concat           Concat_120               3 1 471 472 473 480 0=0
Reshape          Reshape_122              1 1 480 482 0=51200
Concat           Concat_123               3 1 474 475 476 483 0=0
Reshape          Reshape_125              1 1 483 485 0=12800
Concat           Concat_126               3 1 477 478 479 486 0=0
Reshape          Reshape_128              1 1 486 488 0=3200
Concat           Concat_129               3 1 482 485 488 output 0=0
